package com.example.homework5.model

object SerialRepository {
    val serials = arrayListOf<Serial>(
        Serial(1,
            "Очень странные дела",
            "2016 - ...",
            "https://wallpapershome.ru/images/pages/pic_h/15284.jpg",
            "1980-е годы, тихий провинциальный американский городок. Благоприятное течение местной жизни нарушает загадочное исчезновение подростка по имени Уилл. Выяснить обстоятельства дела полны решимости родные мальчика и местный шериф, также события затрагивают лучшего друга Уилла – Майка. Он начинает собственное расследование. Майк уверен, что близок к разгадке, и теперь ему предстоит оказаться в эпицентре ожесточенной битвы потусторонних сил."),
        Serial(2,
            "Энн",
            "2017 - 2019",
            "https://img5.goodfon.ru/wallpaper/nbig/9/dd/anne-with-an-e-enn-serial-emibet-maknalti-amybeth-mcnulty-tv.jpg",
            "Энн — тринадцатилетняя сирота. Девочка рано лишилась родителей и с тех пор живёт в детском приюте. Жизнь героини резко меняется, когда в результате ошибки она попадает к новым приёмным родителям, старой деве и её младшему брату."),
        Serial(3,
            "Бумажный дом",
            "2017 - 2021",
            "https://img5.goodfon.ru/wallpaper/nbig/7/75/bumazhnyi-dom-la-casa-de-papel-money-heist-tv-series-serial.jpg",
            "История о преступниках, решивших ограбить Королевский монетный двор Испании и украсть 2,4 млрд евро."),
        Serial(4,
            "Ведьмак",
            "2019 - ...",
            "https://witcher-tv.ru/wp-content/uploads/2019/12/hero-poster-full-hd.jpg",
            "Ведьмак Геральт, мутант и убийца чудовищ, на своей верной лошади по кличке Плотва путешествует по Континенту. За тугой мешочек чеканных монет этот мужчина избавит вас от всякой настырной нечисти — хоть от чудищ болотных, оборотней и даже заколдованных принцесс. В сельской глуши местную девушку Йеннифэр, которой сильно не повезло с внешностью, зато посчастливилось иметь способности к магии, отец продаёт колдунье в ученицы. А малолетняя наследница королевства Цинтра по имени Цири вынуждена пуститься в бега, когда их страну захватывает империя Нильфгаард. Судьбы этих троих окажутся тесно связаны, но скоро сказка сказывается, да не скоро дело делается."),
        Serial(5,
            "Ты",
            "2018 - ...",
            "https://cdn.smartfacts.ru/384841/ty-you_0.jpg",
            "На что вы готовы ради любви? Когда успешный менеджер книжного магазина встречает талантливую начинающую писательницу, для него ответ очевиден: абсолютно на все. Используя соцсети, он узнает мельчайшие подробности о жизни девушки, чтобы подобраться к ней как можно ближе. Милая влюбленность перерастает в опасную одержимость. Парень готов тихо и методично устранить любое препятствие на пути к своей цели, даже если это препятствие — человек."),
        Serial(6,
            "Тень и кость",
            "2021",
            "https://pw.artfile.me/wallpaper/04-06-2021/650x366/shadow-and-bone--serial-2021-kino-filmy--1568960.jpg",
            "В мире, разделенном на две части барьером вечной темноты, где сверхъестественные существа питаются человеческой плотью, девушка-солдат обнаруживает в себе невероятную силу, которая может объединить страну. Но против нее строят заговоры опасные силы. Бандиты, воры, убийцы и святые находятся в состоянии войны, и для выживания потребуется больше, чем магия."),
        Serial(7,
            "Джинни и Джорджия",
            "2021 - ...",
            "https://static.kinoafisha.info/k/series_shots/1920x1080/upload/series/frames/2/8/5/3582/05fc78aa66eb70a7a59866865d9e9be4.jpg",
            "Джорджия и ее дочь-подросток Джинни надеются начать жизнь с чистого листа в новом городе, но прошлое матери угрожает их будущему."),
        Serial(8,
            "Рагнарек",
            "2020",
            "https://images.wallpapersden.com/image/download/netflix-ragnarok_bGpnZ2yUmZqaraWkpJRnZWltrWZmamc.jpg",
            "В крошечный норвежский городок Эдда возвращаются с матерью сыновья-подростки Магне и Лориц. Их семья покинула Эдду много лет назад после гибели отца мальчишек, а теперь мать нашла тут работу: она устраивается бухгалтером на завод местных богачей Ютулов. Ютулы верховодят в Эдде повсюду: красавцы Фьор и Сакса — самые популярные подростки в школе, а их мать в этой школе директор. Их завод производит химикаты, и одноклассница Магне подозревает, что Ютулы каким-то образом загадили ртутью местный фьорд. Магне втягивается в её праведную борьбу и вскоре обнаруживает у себя суперспособность: он может метнуть молот больше чем на 500 метров."),
        Serial(9,
            "Бриджертоны",
            "2020 - ...",
            "https://static.tildacdn.com/tild3336-3336-4962-b339-663336616431/Untitled-1_2-2.png",
            "История о восьми дружных братьях и сестрах влиятельной семьи Бриджертонов, которые пытаются найти любовь."),
        Serial(10,
            "Элита",
            "2018 - ...",
            "https://thumbs.dfs.ivi.ru/storage15/contents/d/b/8557e6e4ee1e23c574167d0a149367.jpg/858x483/?q=60",
            "Трое подростков из бедных семей попадают в «Лас Энчинас» — самую престижную школу в стране. Обеспеченным деткам не нравятся новички, и начинается безжалостная битва за власть. В ход идут любые средства и методы, даже убийство."),
        Serial(11,
            "Игра в кальмара",
            "2021 - ...",
            "https://thumbs.dfs.ivi.ru/storage8/contents/0/9/043599e4c9a5c787970a2c70f7f629.jpg/858x483/?q=60",
            "Сон Ки-хун разведен, по уши погряз в долгах, а тут еще бывшая жена сообщает, что собирается увезти их дочь в Америку. В отчаянии мужчина соглашается на предложение загадочного незнакомца и становится участником таинственных игр на выживание с призом в 40 миллионов долларов. Среди нескольких сотен игроков оказываются друг детства Ки-хуна, бандит, смертельно больной старик, северокорейская перебежчица, иммигрант из Пакистана и многие другие отчаянно нуждающиеся в деньгах люди."),

        )

    val serial: MutableList<Item.Serial>
        get() = serials.map {

            Item.Serial(
                id = it.id,
                name = it.name,
                year = it.year,
                url = it.url,
                description = it.description
            )
        }.toMutableList()

//    var mainItems = arrayListOf<Item>().apply {
//        val count = serials.size / 5
//        var k = 0
//        for (i in 1..count){
//            addAll(serial.subList(k, k+5))
//            add(Item.Ad("Играешь на музыкальном инструменте или поешь? Тогда приходи к нам в ", "Адрес: Двойка, 14 этаж возле теннисного стола",
//                ""))
//            k += 5
//        }
//        if(serials.size%5!=0){
//            addAll(serial.subList(count*5, serials.size))
//        }
//    }.toMutableList()


    var mainItems = arrayListOf<Item>().apply{
        var k = 0
        var item = 0
        for (i in 0..serials.size){
            if(i%6!=5){
                add(serial[i-k])
                item = i-k
            }else{
                add(Item.Ad("Играешь на музыкальном инструменте или поешь? Тогда приходи к нам в ", "Адрес: Двойка, 14 этаж возле теннисного стола",
                    ""))
                k += 1
            }
        }
        if(item + 1 < serials.size){
            addAll(serial.subList(item+1, serials.size))
        }
    }.toMutableList()


    fun deleteItem(position: Int) {
        val list = mainItems
        list.removeAt(position)
        for (i in position until mainItems.size - 2) {
            if (list[i] is Item.Ad && i % 6 != 5) {
                list[i] = list[i + 1].also {
                    list[i + 1] = list[i]
                }
            }
        }

        for (i in 0 .. mainItems.size - 2){
            if(list[i] is Item.Ad && list[i+1] is Item.Ad){
                list.removeAt(i+1)
            }
        }
        if(list.size <= 5 && list[list.size - 1] is Item.Ad){
            list.removeAt(list.size - 1)
        }
        mainItems= list.toMutableList()
    }

    fun addItem(position: Int, item:Item.Serial){
        val list = mainItems
        if(position >= mainItems.size - 1){
            list.add(item)
        }else{
            list.add(position,item)
            for (i in position until mainItems.size){
                if(list[i] is Item.Ad && i%6!=5){
                    list[i] = list[i-1].also{
                        list[i-1] = list[i]
                    }
                }
            }
        }
        mainItems = list.toMutableList()
    }



//    val mainItems: MutableList<Item> = mutableListOf(
//        Item.Serial(1,
//            "Очень странные дела",
//            "2016 - ...",
//            "https://wallpapershome.ru/images/pages/pic_h/15284.jpg",
//            "1980-е годы, тихий провинциальный американский городок. Благоприятное течение местной жизни нарушает загадочное исчезновение подростка по имени Уилл. Выяснить обстоятельства дела полны решимости родные мальчика и местный шериф, также события затрагивают лучшего друга Уилла – Майка. Он начинает собственное расследование. Майк уверен, что близок к разгадке, и теперь ему предстоит оказаться в эпицентре ожесточенной битвы потусторонних сил."),
//        Item.Serial(2,
//            "Энн",
//            "2017 - 2019",
//            "https://img5.goodfon.ru/wallpaper/nbig/9/dd/anne-with-an-e-enn-serial-emibet-maknalti-amybeth-mcnulty-tv.jpg",
//            "Энн — тринадцатилетняя сирота. Девочка рано лишилась родителей и с тех пор живёт в детском приюте. Жизнь героини резко меняется, когда в результате ошибки она попадает к новым приёмным родителям, старой деве и её младшему брату."),
//        Item.Serial(3,
//            "Бумажный дом",
//            "2017 - 2021",
//            "https://img5.goodfon.ru/wallpaper/nbig/7/75/bumazhnyi-dom-la-casa-de-papel-money-heist-tv-series-serial.jpg",
//            "История о преступниках, решивших ограбить Королевский монетный двор Испании и украсть 2,4 млрд евро."),
//        Item.Serial(4,
//            "Ведьмак",
//            "2019 - ...",
//            "https://witcher-tv.ru/wp-content/uploads/2019/12/hero-poster-full-hd.jpg",
//            "Ведьмак Геральт, мутант и убийца чудовищ, на своей верной лошади по кличке Плотва путешествует по Континенту. За тугой мешочек чеканных монет этот мужчина избавит вас от всякой настырной нечисти — хоть от чудищ болотных, оборотней и даже заколдованных принцесс. В сельской глуши местную девушку Йеннифэр, которой сильно не повезло с внешностью, зато посчастливилось иметь способности к магии, отец продаёт колдунье в ученицы. А малолетняя наследница королевства Цинтра по имени Цири вынуждена пуститься в бега, когда их страну захватывает империя Нильфгаард. Судьбы этих троих окажутся тесно связаны, но скоро сказка сказывается, да не скоро дело делается."),
//        Item.Serial(5,
//            "Ты",
//            "2018 - ...",
//            "https://cdn.smartfacts.ru/384841/ty-you_0.jpg",
//            "На что вы готовы ради любви? Когда успешный менеджер книжного магазина встречает талантливую начинающую писательницу, для него ответ очевиден: абсолютно на все. Используя соцсети, он узнает мельчайшие подробности о жизни девушки, чтобы подобраться к ней как можно ближе. Милая влюбленность перерастает в опасную одержимость. Парень готов тихо и методично устранить любое препятствие на пути к своей цели, даже если это препятствие — человек."),
//        Item.Ad("Играешь на музыкальном инструменте или поешь? Тогда приходи к нам в ", "Адрес: Двойка, 14 этаж возле теннисного стола",
//                ""),
//        Item.Serial(6,
//            "Тень и кость",
//            "2021",
//            "https://pw.artfile.me/wallpaper/04-06-2021/650x366/shadow-and-bone--serial-2021-kino-filmy--1568960.jpg",
//            "В мире, разделенном на две части барьером вечной темноты, где сверхъестественные существа питаются человеческой плотью, девушка-солдат обнаруживает в себе невероятную силу, которая может объединить страну. Но против нее строят заговоры опасные силы. Бандиты, воры, убийцы и святые находятся в состоянии войны, и для выживания потребуется больше, чем магия."),
//        Item.Serial(7,
//            "Джинни и Джорджия",
//            "2021 - ...",
//            "https://static.kinoafisha.info/k/series_shots/1920x1080/upload/series/frames/2/8/5/3582/05fc78aa66eb70a7a59866865d9e9be4.jpg",
//            "Джорджия и ее дочь-подросток Джинни надеются начать жизнь с чистого листа в новом городе, но прошлое матери угрожает их будущему."),
//        Item.Serial(8,
//            "Рагнарек",
//            "2020",
//            "https://images.wallpapersden.com/image/download/netflix-ragnarok_bGpnZ2yUmZqaraWkpJRnZWltrWZmamc.jpg",
//            "В крошечный норвежский городок Эдда возвращаются с матерью сыновья-подростки Магне и Лориц. Их семья покинула Эдду много лет назад после гибели отца мальчишек, а теперь мать нашла тут работу: она устраивается бухгалтером на завод местных богачей Ютулов. Ютулы верховодят в Эдде повсюду: красавцы Фьор и Сакса — самые популярные подростки в школе, а их мать в этой школе директор. Их завод производит химикаты, и одноклассница Магне подозревает, что Ютулы каким-то образом загадили ртутью местный фьорд. Магне втягивается в её праведную борьбу и вскоре обнаруживает у себя суперспособность: он может метнуть молот больше чем на 500 метров."),
//        Item.Serial(9,
//            "Бриджертоны",
//            "2020 - ...",
//            "https://static.tildacdn.com/tild3336-3336-4962-b339-663336616431/Untitled-1_2-2.png",
//            "История о восьми дружных братьях и сестрах влиятельной семьи Бриджертонов, которые пытаются найти любовь."),
//        Item.Serial(10,
//            "Элита",
//            "2018 - ...",
//            "https://thumbs.dfs.ivi.ru/storage15/contents/d/b/8557e6e4ee1e23c574167d0a149367.jpg/858x483/?q=60",
//            "Трое подростков из бедных семей попадают в «Лас Энчинас» — самую престижную школу в стране. Обеспеченным деткам не нравятся новички, и начинается безжалостная битва за власть. В ход идут любые средства и методы, даже убийство."),
//        Item.Ad("Играешь на музыкальном инструменте или поешь? Тогда приходи к нам в ", "Адрес: Двойка, 14 этаж возле теннисного стола",
//            ""),
//        Item.Serial(11,
//            "Игра в кальмара",
//            "2021 - ...",
//            "https://thumbs.dfs.ivi.ru/storage8/contents/0/9/043599e4c9a5c787970a2c70f7f629.jpg/858x483/?q=60",
//            "Сон Ки-хун разведен, по уши погряз в долгах, а тут еще бывшая жена сообщает, что собирается увезти их дочь в Америку. В отчаянии мужчина соглашается на предложение загадочного незнакомца и становится участником таинственных игр на выживание с призом в 40 миллионов долларов. Среди нескольких сотен игроков оказываются друг детства Ки-хуна, бандит, смертельно больной старик, северокорейская перебежчица, иммигрант из Пакистана и многие другие отчаянно нуждающиеся в деньгах люди."),
//
//        )


}